###Summarizing and Computing Descriptive Statistics

Pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame.

In [2]:
from pandas import DataFrame, Series
import numpy as np
import pandas as pd
import sys

In [3]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
[np.nan, np.nan], [0.75, -1.3]],
index=['a', 'b', 'c', 'd'],
columns=['one', 'two'])

In [4]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [7]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

idxmin and idxmax , return indirect statistics like the index value where the minimum or maximum values are attained:

In [11]:
df.idxmax()

one    b
two    d
dtype: object

In [8]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

describe produces multiple summary statistics in one shot:

In [14]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

On non-numeric data, describe produces alternate summary statistics:

In [18]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [19]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

###Correlation and Covariance

correlation and covariance, are computed from pairs of arguments. Letâ€™s consider some DataFrames of stock prices and volumes obtained from Yahoo! Finance

In [9]:
import pandas.io.data as web
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_google(ticker, '1/1/2013', '1/1/2014')

In [11]:
all_data['AAPL']

             Open   High    Low  Close     Volume
Date
2013-01-02  79.12  79.29  77.38  78.43  140124866
2013-01-03  78.27  78.52  77.29  77.44   88240950
2013-01-04  76.71  76.95  75.12  75.29  148581860
2013-01-07  74.60  75.60  73.60  74.80  121038176
2013-01-08  75.60  75.98  74.46  75.04  114676751
2013-01-09  74.64  75.00  73.71  73.87  101899959
2013-01-10  75.51  75.53  73.65  74.79  150285296
2013-01-11  74.43  75.05  74.15  74.33   87688741
2013-01-14  71.81  72.50  71.22  71.68  183544396
2013-01-15  71.19  71.28  69.05  69.42  219192932
2013-01-16  70.66  72.78  70.36  72.30  172700045
2013-01-17  72.90  72.96  71.72  71.81  113412579
2013-01-18  71.22  71.75  70.91  71.43  118287267
2013-01-22  72.08  72.55  70.95  72.11  115386173
2013-01-23  72.69  73.57  72.11  73.43  215375853
2013-01-24  65.71  66.53  64.32  64.36  365212953
2013-01-25  64.53  65.18  62.14  62.84  301993503
2013-01-28  62.55  64.74  62.27  64.26  196378931
2013-01-29  65.50  65.74  64.59  65.47  142768017
2013-01-30  65.29  66.09  64.93  65.26  104288317
2013-01-31  65.28  65.61  65.00  65.07   79833215
2013-02-01  65.59  65.64  64.05  64.80  134867089
2013-02-04  64.84  65.13  63.14  63.19  119278754
2013-02-05  63.44  65.68  63.17  65.41  143336536
2013-02-06  65.21  66.64  64.65  65.34  148426012
2013-02-07  66.18  67.14  64.87  66.89  176145074
2013-02-08  67.71  68.40  66.89  67.85  158288984
2013-02-11  68.07  69.28  67.61  68.56  129358516
2013-02-12  68.50  68.91  66.82  66.84  152262712
2013-02-13  66.74  67.66  66.17  66.72  118801221
...           ...    ...    ...    ...        ...
2013-11-18  75.00  75.31  74.03  74.09   61236224
2013-11-19  74.15  74.77  74.00  74.22   52234707
2013-11-20  74.18  74.35  73.48  73.57   48545798
2013-11-21  73.94  74.46  73.38  74.45   65506861
2013-11-22  74.22  74.59  74.08  74.26   55931232
2013-11-25  74.43  75.12  74.43  74.82   57348403
2013-11-26  74.87  76.59  74.86  76.20  100345728
2013-11-27  76.62  78.00  76.20  77.99   90861841
2013-11-29  78.50  79.76  78.26  79.44   79532215
2013-12-02  79.71  80.62  78.69  78.75  118135885
2013-12-03  79.76  80.91  79.67  80.90  112741734
2013-12-04  80.79  81.31  80.12  80.71   94452666
2013-12-05  81.81  82.16  80.92  81.13  111895315
2013-12-06  80.83  80.96  79.94  80.00   86088352
2013-12-09  80.14  81.37  80.13  80.92   80123533
2013-12-10  80.52  81.13  80.17  80.79   69567610
2013-12-11  81.01  81.57  79.96  80.19   89929693
2013-12-12  80.38  80.76  80.00  80.08   65572318
2013-12-13  80.34  80.41  79.10  79.20   83205283
2013-12-16  79.37  80.38  79.29  79.64   70648452
2013-12-17  79.39  79.92  79.05  79.28   57475649
2013-12-18  78.21  78.78  76.97  78.68  141465807
2013-12-19  78.38  78.57  77.68  77.78   80239369
2013-12-20  77.91  78.80  77.83  78.43  109103435
2013-12-23  81.14  81.53  80.39  81.44  125326831
2013-12-24  81.41  81.70  80.86  81.10   41888735
2013-12-26  81.16  81.36  80.48  80.56   51002035
2013-12-27  80.55  80.63  79.93  80.01   56471317
2013-12-30  79.64  80.01  78.90  79.22   63407722
2013-12-31  79.17  80.18  79.14  80.15   55819372

[252 rows x 5 columns]

In [12]:
price = DataFrame({tic: data['Close'] for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [13]:
returns = price.pct_change()

In [15]:
dir(price)

['AAPL',
 'GOOG',
 'IBM',
 'MSFT',
 'T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_SLICEMAP',
 '__abs__',
 '__add__',
 '__and__',
 '__array__',
 '__array_wrap__',
 '__bool__',
 '__bytes__',
 '__class__',
 '__contains__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__imul__',
 '__init__',
 '__invert__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__le__',
 '__len__',
 '__lt__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__unicode__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_agg_by_level',
 '_align_frame',
 '_align_series',
 '_apply_broadcast',
 '_apply_empty_result',
 '_apply_raw',
 '_apply_standard',
 '_at',
 '_auto_consolidate',
 '_box_col_values',
 '_box_item_values',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_combine_const',
 '_combine_frame',
 '_combine_match_columns',
 '_combine_match_index',
 '_combine_series',
 '_combine_series_infer',
 '_compare_frame',
 '_compare_frame_evaluate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_for_slice',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_count_level',
 '_create_indexer',
 '_dir_additions',
 '_dir_deletions',
 '_ensure_valid_index',
 '_expand_axes',
 '_flex_compare_frame',
 '_from_arrays',
 '_from_axes',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_numeric_data',
 '_get_values',
 '_getitem_array',
 '_getitem_column',
 '_getitem_frame',
 '_getitem_multilevel',
 '_getitem_slice',
 '_iat',
 '_iget_item_cache',
 '_iloc',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_dict',
 '_init_mgr',
 '_init_ndarray',
 '_internal_names',
 '_internal_names_set',
 '_is_cached',
 '_is_datelike_mixed_type',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_join_compat',
 '_loc',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_axis',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_reset_cache',
 '_sanitize_column',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_is_copy',
 '_set_item',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_setup_axes',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_typ',
 '_unpickle_frame_compat',
 '_unpickle_matrix_compat',
 '_update_inplace',
 '_validate_dtype',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'as_blocks',
 'as_matrix',
 'asfreq',
 'assign',
 'astype',
 'at',
 'at_time',
 'axes',
 'between_time',
 'bfill',
 'blocks',
 'bool',
 'boxplot',
 'clip',
 'clip_lower',
 'clip_upper',
 'columns',
 'combine',
 'combineAdd',
 'combineMult',
 'combine_first',
 'compound',
 'consolidate',
 'convert_objects',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_csv',
 'from_dict',
 'from_items',
 'from_records',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_value',
 'get_values',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'icol',
 'idxmax',
 'idxmin',
 'iget_value',
 'iloc',
 'index',
 'info',
 'insert',
 'interpolate',
 'irow',
 'is_copy',
 'isin',
 'isnull',
 'items',
 'iteritems',
 'iterkv',
 'iterrows',
 'itertuples',
 'ix',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'load',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'notnull',
 'pct_change',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'save',
 'select',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'set_value',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort',
 'sort_index',
 'sortlevel',
 'squeeze',
 'stack',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_panel',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sparse',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_wide',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']

In [14]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2013-12-24 -0.004175 -0.002926  0.005433  0.012561
2013-12-26 -0.006658  0.005060  0.011625  0.009709
2013-12-27 -0.006827  0.000842 -0.001457 -0.004006
2013-12-30 -0.009874 -0.007984  0.007186  0.000000
2013-12-31  0.011739  0.010123  0.006223  0.003218

The corr method of Series computes the correlation of the overlapping, non-NA, aligned-by-index values in two Series. Relatedly, cov computes the covariance

In [34]:
returns.MSFT.corr(returns.IBM)

0.169609500416842

In [35]:
returns.MSFT.cov(returns.IBM)

3.0928670124405632e-05

DataFrameâ€™s corr and cov methods, on the other hand, return a full correlation or covariance matrix as a DataFrame

In [36]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.108642  0.114287  0.070419
GOOG  0.108642  1.000000  0.203534  0.221290
IBM   0.114287  0.203534  1.000000  0.169610
MSFT  0.070419  0.221290  0.169610  1.000000

In [37]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000321  0.000027  0.000024  0.000020
GOOG  0.000027  0.000190  0.000033  0.000048
IBM   0.000024  0.000033  0.000136  0.000031
MSFT  0.000020  0.000048  0.000031  0.000244

Using DataFrameâ€™s corrwith method, you can compute pairwise correlations between a DataFrameâ€™s columns or rows with another Series or DataFrame

In [38]:
returns.corrwith(returns.IBM)

AAPL    0.114287
GOOG    0.203534
IBM     1.000000
MSFT    0.169610
dtype: float64

In [39]:
returns.corrwith(volume)

AAPL   -0.165444
GOOG         NaN
IBM    -0.351866
MSFT   -0.116474
dtype: float64

###Unique Values, Value Counts

In [17]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [18]:
obj1 = Series(['c', 'a', 'd', 'a', 'a', 'b', 'e', 'c', 'f'])

In [19]:
df = DataFrame({'one':obj,'two':obj1})

In [20]:
df

  one two
0   c   c
1   a   a
2   d   d
3   a   a
4   a   a
5   b   b
6   b   e
7   c   c
8   c   f

In [21]:
uniques = obj.unique()

In [22]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [24]:
df.one.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [43]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

isin is responsible for vectorized set membership and can be very useful in filtering a data set down to a subset of values in a Series or column in a DataFrame

In [25]:
mask = obj.isin(['b', 'c'])

In [45]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [27]:
df.isin(['b','c'])

     one    two
0   True   True
1  False  False
2  False  False
3  False  False
4  False  False
5   True   True
6   True  False
7   True   True
8   True  False

###Handling Missing Data

Pandas uses the floating point value NaN (Not a Number) to represent missing data in both floating as well as in non-floating point arrays. It is just used as a sentinel that can be easily detected

In [28]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [29]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [31]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

Filtering Out Missing Data

In [53]:
data = Series([1, np.nan, 3.5, np.nan, 7])

In [54]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

Naturally, you could have computed this yourself by boolean indexing:

In [56]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

With DataFrame objects, these are a bit more complex. You may want to drop rows or columns which are all NA or just those containing any NAs. dropna by default drops any row containing a missing value

In [32]:
data = DataFrame([[1., 6.5, 3.], [1., np.nan,np.nan],
[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [37]:
cleaned = data.dropna()

In [38]:
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [39]:
cleaned

   0    1  2
0  1  6.5  3

In [62]:
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [63]:
data[4] = np.nan

In [64]:
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [65]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

###Filling in Missing Data

Calling fillna with a constant replaces missing values with that value:

In [50]:
data.fillna('A')

   0    1  2
0  1  6.5  3
1  1    A  A
2  A    A  A
3  A  6.5  3

Calling fillna with a dict you can use a different fill value for each column:

In [45]:
data.fillna({1: 0.5, 2: -1})

    0    1  2
0   1  6.5  3
1   1  0.5 -1
2 NaN  0.5 -1
3 NaN  6.5  3

In [46]:
df = DataFrame(np.random.randn(6, 3))

In [47]:
df.ix[2:, 1] = np.nan; df.ix[4:, 2] = np.nan

In [48]:
df

          0         1         2
0 -0.010787 -0.107010  0.145274
1  1.124550  0.853446 -0.367650
2 -0.779427       NaN  0.701738
3  0.486967       NaN  0.136004
4 -1.222734       NaN       NaN
5  1.712014       NaN       NaN

In [49]:
df.fillna(method='ffill')

          0         1         2
0 -0.010787 -0.107010  0.145274
1  1.124550  0.853446 -0.367650
2 -0.779427  0.853446  0.701738
3  0.486967  0.853446  0.136004
4 -1.222734  0.853446  0.136004
5  1.712014  0.853446  0.136004

In [51]:
data = Series([1., np.nan, 3.5, np.nan, 7])

In [52]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [53]:
df.fillna(df.mean())

          0         1         2
0 -0.010787 -0.107010  0.145274
1  1.124550  0.853446 -0.367650
2 -0.779427  0.373218  0.701738
3  0.486967  0.373218  0.136004
4 -1.222734  0.373218  0.153842
5  1.712014  0.373218  0.153842

###Reading and Writing Data in Text Format

In [76]:
!cat ../../../data/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [77]:
df = pd.read_csv('../../../data/ex1.csv')

In [78]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [79]:
df = pd.read_table('../../../data/ex1.csv',sep=',')

In [80]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [89]:
pd.read_csv('../../../data/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [88]:
pd.read_csv('../../../data/ex2.csv',names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [85]:
names = ['a', 'b', 'c', 'd', 'message']

Suppose you wanted the message column to be the index of the returned DataFrame

In [87]:
pd.read_csv('../../../data/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In some cases, a table might not have a fixed delimiter, using whitespace or some other pattern to separate fields. In these cases, you can pass a regular expression as a delimiter for read_table .

In [9]:
!cat ../../../data/ex3.txt

  A  B C
aaa -0.264438 -1.026059 -0.619500
bbb 0.927272 0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382 1.100491

In [4]:
pd.read_table('../../../data/ex3.txt', sep='\s+')

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [8]:
!cat ../../../data/ex4.csv

#hey
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv('../../../data/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Handling missing values is an important and frequently nuanced part of the file parsing process. Missing data is usually either not present (empty string) or marked by some sentinel value. By default, pandas uses a set of commonly occurring sentinels, such as
NA ,'' , and NULL :

In [10]:
!cat ../../../data/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo
In [864]: result = pd.read_csv('ch06/ex5.csv')

In [14]:
pd.read_csv('../../../data/ex5.csv')

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6 NaN   8   world
2     three  9  10  11  12     foo

The na_values option can take either a list or set of strings to consider missing values

In [16]:
pd.read_csv('../../../data/ex5.csv', na_values=['NULL'])

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6 NaN   8   world
2     three  9  10  11  12     foo

In [17]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [19]:
pd.read_csv('../../../data/ex5.csv', na_values=sentinels)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6 NaN   8   world
2     three  9  10  11  12     NaN

In [21]:
pd.read_csv('../../../data/ex5.csv', nrows=2)

  something  a  b   c  d message
0       one  1  2   3  4     NaN
1       two  5  6 NaN  8   world

###Writing Data Out to Text Format

In [22]:
data = pd.read_csv('../../../data/ex5.csv')

In [23]:
data

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6 NaN   8   world
2     three  9  10  11  12     foo

In [24]:
data.to_csv('../../../data/out.csv')

In [27]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

Missing values appear as empty strings in the output. You might want to denote them by some other sentinel value:

In [28]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [29]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [31]:
data.to_csv(sys.stdout, index=False, cols=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [35]:
dates = pd.date_range('1/1/2000', periods=7)

In [36]:
ts = Series(np.arange(7),index=dates)

In [39]:
ts.to_csv(sys.stdout)

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

###Reading Microsoft Excel Files

xls_file = pd.ExcelFile('data.xls')

table = xls_file.parse('Sheet1')